КАКерамика_моя_старая_база/src/InformationRegisters/ТерриторииОрганизацийПоКоронавирусу/ТерриторииОрганизацийПоКоронавирусу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТерриторииОрганизацийПоКоронавирусу</name>
  <resources>
    <name>Территория</name>
    <type>
      <types>CatalogRef.ТерриторииСПовышающимКоэффициентомПоКоронавирусу</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/ТерриторииОрганизацийПоКоронавирусу/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ТерриторииОрганизаций(Организации = Неопределено) Экспорт
	
	ТерриторииОрганизаций = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организации",Организации);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Организации = Неопределено);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТерриторииОрганизацийПоКоронавирусу.Организация КАК Организация,
	|	ТерриторииОрганизацийПоКоронавирусу.Территория КАК Территория
	|ИЗ
	|	РегистрСведений.ТерриторииОрганизацийПоКоронавирусу КАК ТерриторииОрганизацийПоКоронавирусу
	|ГДЕ
	|	(&ПоВсемОрганизациям
	|			ИЛИ ТерриторииОрганизацийПоКоронавирусу.Организация В (&Организации))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТерриторииОрганизаций.Вставить(Выборка.Организация, Выборка.Территория);
	КонецЦикла;
	
	Возврат ТерриторииОрганизаций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
